БухЭксп/Documents/CW_ВыбытиеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ВыбытиеТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШиныТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановкиШины</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_МестаУстановкиШинТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТопливоТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Топливо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_ВыбытиеТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ВедетсяУчетШинТранспортногоСредства 	= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	
	ДанныеДляПроведения 		= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	СтркутрураПараметров		= CW_УчетСобственногоТранспортаСервер.ПолучитьУстанавливаемыеПараметры();
	
	Состояние = ПредопределенноеЗначение("Справочник.CW_СостоянияТС.Выбыло");
	
	//----
	//СостояниеТС
	СтрокаСостояния = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
	СтрокаСостояния.Период 					= Дата;
	СтрокаСостояния.ТранспортноеСредство 	=  ТранспортноеСредство;
	СтрокаСостояния.Состояние 				=  Состояние;
	
	//----
	//ПараметрыТС
	
	Для Каждого ЭлементСтркутуры из СтркутрураПараметров Цикл
		СтрокаПараметрыТС = ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
		СтрокаПараметрыТС.Период 						= Дата;
		СтрокаПараметрыТС.ТранспортноеСредство 			= ТранспортноеСредство;
		СтрокаПараметрыТС.ПараметрТранпортногоСредства 	= ЭлементСтркутуры.Значение;
	КонецЦикла;
	
	//ТопливоТС
	Для Каждого СтрокаТоплива из ТопливоТранспортногоСредства Цикл
		СтрокаТопливоТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
		СтрокаТопливоТС.Период 					= Дата;
		СтрокаТопливоТС.ВидДвижения 			= ВидДвиженияНакопления.Расход;
		СтрокаТопливоТС.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаТопливоТС.Топливо 				= СтрокаТоплива.Топливо;
		СтрокаТопливоТС.Количество 				= СтрокаТоплива.Количество;
	КонецЦикла;
	
	// ---
	Если ВедетсяУчетШинТранспортногоСредства Тогда
		
		Для каждого СтрокаШин из ШиныТранспортногоСредства Цикл
			СтрокаШины = ДанныеДляПроведения.CW_ШиныТС.Добавить();
			СтрокаШины.Период 					= Дата;
			СтрокаШины.ТранспортноеСредство 	= ТранспортноеСредство;
			СтрокаШины.МестоУстановкиШины 		= СтрокаШин.МестоУстановкиШины;
		КонецЦикла;
		
	КонецЕсли;
	// ---	
 	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
КонецПроцедуры
#КонецЕсли
